Revit 2027 API
BoundaryConditions.CreateAreaBoundaryConditions(Document, Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) Method
 Creates a new hosted area boundary conditions within the project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BoundaryConditions CreateAreaBoundaryConditions(
	Document doc,
	Reference reference,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus
)
Public Shared Function CreateAreaBoundaryConditions (
	doc As Document,
	reference As Reference,
	X_Translation As TranslationRotationValue,
	X_TranslationSpringModulus As Double,
	Y_Translation As TranslationRotationValue,
	Y_TranslationSpringModulus As Double,
	Z_Translation As TranslationRotationValue,
	Z_TranslationSpringModulus As Double
) As BoundaryConditions
public:
static BoundaryConditions^ CreateAreaBoundaryConditions(
	Document^ doc,
	Reference^ reference,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus
)
static member CreateAreaBoundaryConditions :
        doc : Document *
        reference : Reference *
        X_Translation : TranslationRotationValue *
        X_TranslationSpringModulus : float *
        Y_Translation : TranslationRotationValue *
        Y_TranslationSpringModulus : float *
        Z_Translation : TranslationRotationValue *
        Z_TranslationSpringModulus : float -> BoundaryConditions
Parameters
doc Document
 The document in which to create the boundary conditions.
reference Reference
 A reference to an analytical element face.
X_Translation TranslationRotationValue
 A value indicating the X axis translation option.
X_TranslationSpringModulus Double
 Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation TranslationRotationValue
 A value indicating the Y axis translation option.
Y_TranslationSpringModulus Double
 Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation TranslationRotationValue
 A value indicating the Z axis translation option.
Z_TranslationSpringModulus Double
 Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
Return Value
BoundaryConditions
 If successful, returns the newly created boundary conditions with the BoundaryConditionsType = 2 - "Area". Otherwise it returns null .
Exceptions
Exception | Condition
ArgumentException |  reference is not a valid host for area boundary conditions. -or- Area boundary conditions already exist on the selected reference.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BoundaryConditions Class
CreateAreaBoundaryConditions Overload
Autodesk.Revit.DB.Structure Namespace